[
  {
    "Id": "6403",
    "ThreadId": "2036",
    "Html": "\r\nHi Everybody !!<br /><br />Excellent Collection of controls guys =)<br /><br />I have an XpProgressBar that I want to share with you to add in the control pack, if you like of course, you can found it here:<br /><br />http://www.codeproject.com/cs/miscctrl/XpProgressBar.asp<br /><br />I have an updated version at home that I can't upload yet, let me now if you want the code.<br /><br />Cheers and thanks for create this big collection of controles<br /><br />Marcos<br />www.devoo.net<br /><br />I just add a post in dotnetkicks here:<br /><br />http://www.dotnetkicks.com/winforms/Ascend<i>NET</i>Nice<i>and</i>FREE<i>WinForms</i>Controls<br /><br />to spread your controls to the rest of the community.<br />",
    "PostedDate": "2006-10-26T06:35:07.497-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "6412",
    "ThreadId": "2036",
    "Html": "\r\nCool, and thank you. The XpProgressBar control is an excellent control also. We will happily add it to the controls. :-)<br /><br />Do you want me to add your user “MarcosMeli” to the project so that you can get to the source control and integrate the control yourself or do you want me to?<br /><br />If you need more information please contact me at ascend_adm@hotmail.com.<br /><br />Thanks,<br />Scorn<br /><br />",
    "PostedDate": "2006-10-26T10:16:04.633-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "6417",
    "ThreadId": "2036",
    "Html": "\r\nThanks Scorn<br /><br />Is a good idea to add me to the users, the problem is that I´m a bit busy at work and with the www.filehelpers.com but I´ll try to add it the weekend to your controls and add a link to your ControlPack in the CodeProject page =)<br /><br />I´m working in other controls for my company and I´m planning to release them as open source, but I´ll be glad to add them to your control collection to make even easier to dot net users to integrate open source components.<br /><br />Cheers<br />I´ll be in contact<br />Marcos<br />",
    "PostedDate": "2006-10-26T10:36:55.26-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]