[
  {
    "Id": "7337",
    "ThreadId": "2322",
    "Html": "\r\nGranted this may fall outside the realm of cool... but the standard groupbox is a pale comparison to its MFC brethren and it lost functionality. The current one only allows for left justified title text and that text is only one color (Blue). So if one is using a GradientPanel and makes the colors dark...then drops a groupbox on it, the title text is washed out....grrr. Here is my recommendation:<br /><br />A group box that does the following things<br /><br />   1) Works well as a container for Ascend's controls.<br />   2) Title text font and color could be specified.<br />   3) Position of title text could be Left, Right and centered.<br />   4) Text could appear on any of the axis of the box in definable alignment.<br />   5) Gradient caption could be used as the Title text.<br /><br />Just my thoughts. <br /><br />advTHANKSance<br />",
    "PostedDate": "2006-11-11T13:31:20.363-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "7475",
    "ThreadId": "2322",
    "Html": "\r\nAre you referring to something similar to NicePanel located at http://www.purecomponents.com/products/nicepanel?<br />",
    "PostedDate": "2006-11-14T08:37:57.943-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "7486",
    "ThreadId": "2322",
    "Html": "\r\nI’ll take a look at the nice panel. I think this could be done and I agree that the current one is a pain.<br /><br />Thanks,<br />Scott<br />",
    "PostedDate": "2006-11-14T10:56:31.953-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "7514",
    "ThreadId": "2322",
    "Html": "\r\nNo not really. It is a nice looking control though but overkill...<br /><br />I am just looking for a jazzed up version of the groupbox that <b>may</b> incorporate Ascend's look and feel if required. If that borders on what NicePanel does...that is fine. <br /><br />",
    "PostedDate": "2006-11-14T17:59:10.787-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]